{
	"1000": {
		"message": "GENERIC_USER_ACCOUNT_ERROR",
		"genericMessage": "This code indicates that there was a generic error which involved a problem with your user account. Further details are unavailable."
	},
	"1001": {
		"message": "NOT_ENOUGH_COINS",
		"genericMessage": "This code indicates that the operation failed because your account balance is insufficient (we refer to funds as 'coins' internally)."
	},
	"1002": {
		"message": "ACCESS_DENIED",
		"genericMessage": "The operation failed because your account does not have necessary permissions"
	},
	"1003": {
		"message": "NOT_LOGGED_IN",
		"genericMessage": "The operation failed because you are not authenticated."
	},
	"1004": {
		"message": "LISTING_LIMIT_EXCEEDED",
		"genericMessage": "The operation failed because you have too many items listed under your account."
	},
	"1005": {
		"message": "NO_MORE_FREE_USES",
		"genericMessage": "The operation failed because you tried to use a paid feature for free (e.g. you tried to feature an item using a free featured listing from a subscription purchase), but your account has no more free uses of that item."
	},
	"1006": {
		"message": "INVALID_PASSWORD",
		"genericMessage": "The supplied password was incorrect."
	},
	"1007": {
		"message": "PASSWORD_UNSET",
		"genericMessage": "Your account does not have a password set on it."
	},
	"1008": {
		"message": "TOO_MANY_PASSWORD_ATTEMPTS",
		"genericMessage": "You have gotten too many passwords wrong, and you must wait."
	},
	"1009": {
		"message": "UNACCEPTABLE_PASSWORD",
		"genericMessage": "That password does not satisfy the password requirements."
	},
	"1010": {
		"message": "TWOFACTOR_INCORRECT",
		"genericMessage": "The supplied two-factor authentication code was not correct."
	},
	"1011": {
		"message": "USERNAME_TAKEN",
		"genericMessage": "That username has already been taken by another account."
	},
	"1012": {
		"message": "UNACCEPTABLE_USERNAME",
		"genericMessage": "That username does not satisfy the username requirements."
	},
	"1013": {
		"message": "EMAIL_UNVERIFIED",
		"genericMessage": "Your account\"s email address has not been verified."
	},
	"1014": {
		"message": "NO_MORE_FREE_USES",
		"genericMessage": "You requested a free usage of something (e.g. featured listing), but your account doesn\"t have any more free uses remaining."
	},
	"1015": {
		"message": "UNACCEPTABLE_EMAIL",
		"genericMessage": "That email address can\"t be used. Try another one."
	},
	"2000": {
		"message": "GENERIC_INTERNAL_ERROR",
		"genericMessage": "The operation failed due to a problem on our end. Further details are unavailable."
	},
	"2001": {
		"message": "DATABASE_ERROR",
		"genericMessage": "The operation failed due to a problem with our database. Please try again in a few moments."
	},
	"2002": {
		"message": "NOT_FOUND",
		"genericMessage": "The operation failed because the requested item (be it a user, a listing, etc.) was not found."
	},
	"2003": {
		"message": "BAD_STATE",
		"genericMessage": "The operation failed because the requested object is in a bad state. The requested operation cannot be completed while the object is in its current state."
	},
	"2004": {
		"message": "NO_MATCHING_ITEMS_FOUND",
		"genericMessage": "Similar to NOT_FOUND, this indicates that the operation failed because we couldn\"t find anything matching your query."
	},
	"2005": {
		"message": "BOT_UNAVAILABLE",
		"genericMessage": "The operation failed because a bot that is needed to complete the operation is currently unavailable, most likely due to Steam issues. Please try again in a few moments."
	},
	"2006": {
		"message": "PAYMENT_GATEWAY_UNAVAILABLE",
		"genericMessage": "The operation failed because a required payment gateway is not available."
	},
	"2007": {
		"message": "CANNOT_CREATE_DIRECTORY",
		"genericMessage": "We weren\"t able to create a directory on our end."
	},
	"2008": {
		"message": "FILE_UPLOAD_ERROR",
		"genericMessage": "The operation failed due to an error in the file upload."
	},
	"2009": {
		"message": "FILE_UPLOAD_ALREADY_EXISTS",
		"genericMessage": "The file you are trying to upload already exists on the server."
	},
	"2010": {
		"message": "CANNOT_DELETE_FILE",
		"genericMessage": "A requested file could not be deleted."
	},
	"2011": {
		"message": "BOT_FULL",
		"genericMessage": "A required bot is full, and cannot accept any more items."
	},
	"2012": {
		"message": "ALREADY_IN_THAT_STATE",
		"genericMessage": "You are trying to change the state of an object, but the object is already in the desired state."
	},
	"2013": {
		"message": "LOCKED",
		"genericMessage": "The requested object is locked and cannot be changed."
	},
	"2014": {
		"message": "PRICE_HAS_CHANGED",
		"genericMessage": "The price on the requested object has changed."
	},
	"2015": {
		"message": "ENCRYPTION_KEY_INVALID",
		"genericMessage": "The encryption key you tried to use is not valid."
	},
	"2016": {
		"message": "DISABLED",
		"genericMessage": "The requested endpoint or system is currently disabled."
	},
	"2017": {
		"message": "MALFORMED_RESPONSE",
		"genericMessage": "A response we received from somewhere (probably Steam) was not well-formed."
	},
	"3000": {
		"message": "BAD_INPUT",
		"genericMessage": "The input to your request was malformed or otherwise bad."
	},
	"3001": {
		"message": "UNACCEPTABLE_ITEM",
		"genericMessage": "When listing an item: we cannot accept that item for sale at this time. When editing an existing item: the requested operation cannot apply to that item."
	},
	"3002": {
		"message": "DUPLICATE_ITEM",
		"genericMessage": "You're trying to list an item that is already on sale or\nYou tried to list the same item in the same request twice or\nYou tried to list two patterned CS:GO items with identical names and differing prices in the same trade"
	},
	"3003": {
		"message": "UNACCEPTABLE_PRICE",
		"genericMessage": "You can't list that item for that price."
	},
	"3004": {
		"message": "DIFFERENT_BOTS_NOT_ALLOWED",
		"genericMessage": "You can't make this request for items on different bots (all items in the request must reside on the same bot)"
	},
	"3005": {
		"message": "BAD_REQUEST",
		"genericMessage": "Your request was missing some data, or it was otherwise bad."
	},
	"3006": {
		"message": "TOO_MANY_REDEMPTIONS",
		"genericMessage": "This object has been redeemed too many times."
	},
	"3007": {
		"message": "CAPTCHA_INVALID",
		"genericMessage": "Your CAPTCHA solution was incorrect, or you need to supply a CAPTCHA solution to complete this action."
	},
	"3008": {
		"message": "RATE_LIMIT_EXCEEDED",
		"genericMessage": "You have been doing that action too frequently, and you must wait."
	},
	"4000": {
		"message": "STEAM_UNAVAILABLE",
		"genericMessage": "Steam is currently not available. Please try again later when Steam is working."
	},
	"4001": {
		"message": "STEAM_LIMIT",
		"genericMessage": "We've run into a Steam limitation (e.g. maximum number of trade offers, maximum number of items)."
	},
	"4002": {
		"message": "STEAM_UNAVAILABLE_CACHED",
		"genericMessage": "Steam is currently not available (we didn't actually check this time, but it failed recently so we're delaying requests so we don't slam Steam). Please try again later when Steam is working."
	},
	"4003": {
		"message": "THIRD_PARTY_UNAVAILABLE",
		"genericMessage": "A third-party service is currently not available."
	}
}